Revit 2027 API
EnergyDataSettings.CheckBuildingOperatingSchedule Method
 Checks that the building operating schedule falls within an appropriate range.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static bool CheckBuildingOperatingSchedule(
	gbXMLBuildingOperatingSchedule buildingOperatingSchedule
)
Public Shared Function CheckBuildingOperatingSchedule (
	buildingOperatingSchedule As gbXMLBuildingOperatingSchedule
) As Boolean
public:
static bool CheckBuildingOperatingSchedule(
	gbXMLBuildingOperatingSchedule buildingOperatingSchedule
)
static member CheckBuildingOperatingSchedule :
        buildingOperatingSchedule : gbXMLBuildingOperatingSchedule -> bool
Parameters
buildingOperatingSchedule gbXMLBuildingOperatingSchedule
 The building operating schedule to be checked.
Return Value
Boolean
 True if the building operating schedule falls within an appropriate range, false otherwise.
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
EnergyDataSettings Class
Autodesk.Revit.DB.Analysis Namespace